pradeepa-s/pdlib_nrf24l01/arm/stellaris_lm4f120h5qr/pdlib_nrf24l01.c
	ucDataRate--;	// 0 for 1 Mbps, 1 for 2 Mbps

	if(ucDataRate)
	{
		ucCurrentVal |= (ucDataRate << 3);
	}else
	{
		ucCurrentVal &= ~(ucDataRate << 3);
	}
	
	NRF24L01_RegisterWrite_8(RF24_RF_SETUP, ucCurrentVal);
}
 
 
 
/* PS:
 * 
 * Function		: 	NRF24L01_SetRFChannel
 * 
 * Arguments	: 	ucRFChannel	:	RF channel value (only 0:6 bits valid)
 * 
 * Return		: 	None
 * 
 * Description	: 	Sets the RF channel frequency based on the below
 * 					formula,
 * 						2400 + ucRFChannel (MHz)
 * 
 */
 
void
NRF24L01_SetRFChannel(unsigned char ucRFChannel)
{
	NRF24L01_RegisterWrite_8(RF24_RF_CH, ucRFChannel);
}
 
 
 
/* PS:
 * 
 * Function		: 	NRF24L01_SetPAGain
 * 
 * Arguments	: 	ucPAGain	: Only bits 0:1 are valid.
 * 
 * Return		: 	None
 * 
 * Description	: 	Sets the power amplifier gain based on the ucPAGain.
 * 					0 = 0 dBm (default)
 * 					-6 = -6 dBm
 * 					-12 = -12 dBm
 * 					-18 = -18 dBm
 * 
 */
 
void
NRF24L01_SetPAGain(int iPAGain)
{
	unsigned char ucCurrentVal = NRF24L01_RegisterRead_8(RF24_RF_SETUP);

	if(iPAGain < -18)
	{
		iPAGain = -18;
	}else if(iPAGain > 0)
	{
		iPAGain = 0;
	}

	 /* PS:
	  * 				11 = 0 dBm (default)
	  *					10 = -6 dBm
	  *					01 = -12 dBm
	  *					00 = -18 dBm
	  */

	iPAGain = 3 - (-1*(iPAGain) / 6);

	if(ucCurrentVal)
	{
		ucCurrentVal |= ((iPAGain && 0x03) << 1);
	}else
	{
		ucCurrentVal &= ~((iPAGain && 0x03) << 1);
	}
	
	NRF24L01_RegisterWrite_8(RF24_RF_SETUP, ucCurrentVal);
} 
 
 
/* PS:
 * 
 * Function		: 	NRF24L01_SetLNAGain
 * 
 * Arguments	: 	ucLNAGain	:	0 - Disable LNA gain
 * 									1 - Enable LNA gain
 * 
 * Return		: 	None
 * 
 * Description	: 	Function will setup the LNA gain of the module.
 * 
 */
 
void
NRF24L01_SetLNAGain(unsigned char ucLNAGain)
{
	unsigned char ucCurrentVal = NRF24L01_RegisterRead_8(RF24_RF_SETUP);
	
	if(ucCurrentVal)
	{
		ucCurrentVal |= (ucLNAGain << 0);
	}else
	{
		ucCurrentVal &= ~(ucLNAGain << 0);
	}

	NRF24L01_RegisterWrite_8(RF24_RF_SETUP, ucCurrentVal);
}


/* PS:
 *
 * Function		: 	NRF24L01_SetARC
 *
 * Arguments	: 	val			:	Minimum is 0(disbaled), Maximum is 15.
 *
 * Return		: 	None
 *
 * Description	: 	Set automatic retransmission count.
 *
 */
void NRF24L01_SetARC(unsigned char val){
	unsigned char cur_val = 0;

	if(val > 15){
		val = 15;
	}

	val &= 0x0F;

	cur_val = NRF24L01_RegisterRead_8(RF24_SETUP_RETR);
	cur_val &= 0xF0;
	cur_val |= val;
	NRF24L01_RegisterWrite_8(RF24_SETUP_RETR, cur_val);
}


/* PS:
 *
 * Function		: 	NRF24L01_SetARD
 *
 * Arguments	: 	usVal		:	Minimum is 250, Maximum is 4000. (in microseconds)
 *
 * Return		: 	None
 *
 * Description	: 	Value should be a multiple of 250. If the input value is not
 * 					a multiple of 250. It will be rounded up to the nearest 250 multiple.
 *
 */
void NRF24L01_SetARD(unsigned short usVal){

	unsigned char reg_val = 0;
	unsigned char cur_val = 0;

	if(usVal < 250){
		usVal = 250;
	}

	// 250 - 0x0000
	// 500 - 0x0001
	// ...
	// 4000 - 0x1111
	usVal = ((usVal / 250) - 1);

	reg_val = ((usVal << 4) & 0xF0);

	cur_val = NRF24L01_RegisterRead_8(RF24_SETUP_RETR);
	cur_val &= 0x0F;
	cur_val |= reg_val;
	NRF24L01_RegisterWrite_8(RF24_SETUP_RETR, cur_val);
}


/* PS:
 *
 * Function		: 	NRF24L01_SetAddressWidth
 *
 * Arguments	: 	ucVal		:	Minimum 3, Maximum 5
 *
 * Return		: 	None
 *
 * Description	: 	Set the address width for TX/RX address
 *
 */
void NRF24L01_SetAddressWidth(unsigned char ucVal){
	unsigned char ucWidth = 3;

	if(ucVal > 5){
		ucWidth = 5;
	}else if(ucVal < 3){
		ucWidth = 3;
	}else{
		ucWidth = ucVal;
	}

	// 3 - 0x01
	// 4 - 0x10
	// 5 - 0x11

	ucWidth -= 2;

	NRF24L01_RegisterWrite_8(RF24_SETUP_AW, ucWidth);
}



/* PS:
 * 
 * Function		: 	NRF24L01_PowerDown
 * 
 * Arguments	: 	None
 * 
 * Return		: 	None
 * 
 * Description	: 	Go to power down mode
 * 
 */
 
void
NRF24L01_PowerDown()
{
	unsigned char ucCurrentVal = NRF24L01_RegisterRead_8(RF24_CONFIG);
	ucCurrentVal &= (~RF24_PWR_UP);
	
	NRF24L01_RegisterWrite_8(RF24_CONFIG, ucCurrentVal);
	
	_NRF24L01_CELow();
}

/* PS:
 * 
 * Function		: 	NRF24L01_PowerUp
 * 
 * Arguments	: 	None
 * 
 * Return		: 	None
 * 
 * Description	: 	Go to Standby mode. Takes 1.5 ms to go to Standby.
 * 
 */
 
void
NRF24L01_PowerUp()
{
	unsigned char ucCurrentVal = NRF24L01_RegisterRead_8(RF24_CONFIG);
	ucCurrentVal |= (RF24_PWR_UP);
	NRF24L01_RegisterWrite_8(RF24_CONFIG, ucCurrentVal);
}


/* PS:
 * 
 * Function		: 	NRF24L01_FlushTX
 * 
 * Arguments	: 	None
 * 
 * Return		: 	None
 * 
 * Description	: 	Flush tx.
 * 
 */
 
void
NRF24L01_FlushTX()
{
	NRF24L01_SendCommand(RF24_FLUSH_TX, NULL, 0);
#ifdef PDLIB_DEBUG
	PrintString("TX buffer flushed \n\r");
#endif
}


/* PS:
 * 
 * Function		: 	NRF24L01_FlushRX
 * 
 * Arguments	: 	None
 * 
 * Return		: 	None
 * 
 * Description	: 	Flush rx.
 * 
 */
 
void
NRF24L01_FlushRX()
{
	NRF24L01_SendCommand(RF24_FLUSH_RX, NULL, 0);
}


/* PS:
 * 
 * Function		: 	NRF24L01_EnableRxMode
 * 
 * Arguments	: 	None
 * 
 * Return		: 	None
 * 
 * Description	: 	Put the module into RX mode and powers up the module
 * 
 */

void
NRF24L01_EnableRxMode()
{
	unsigned char ucCurrentVal = NRF24L01_GetStatus();

	NRF24L01_PowerUp();

	// PS: Clear RX_DR interrupt
	ucCurrentVal |= RF24_RX_DR;
	NRF24L01_RegisterWrite_8(RF24_STATUS, ucCurrentVal);

	ucCurrentVal = NRF24L01_RegisterRead_8(RF24_CONFIG);
	ucCurrentVal |= (RF24_PRIM_RX | RF24_PWR_UP);
	
	NRF24L01_RegisterWrite_8(RF24_CONFIG, ucCurrentVal);
	
	_NRF24L01_CEHigh();
}


/* PS:
 *
 * Function		: 	NRF24L01_DisableRxMode
 *
 * Arguments	: 	None
 *
 * Return		: 	None
 *
 * Description	: 	Put the module into Standby I state with RX mode. Inline function.
 *
 */
inline void NRF24L01_DisableRxMode()
{
	_NRF24L01_CELow();
}



/* PS:
 * 
 * Function		: 	NRF24L01_EnableTxMode
 * 
 * Arguments	: 	None
 * 
 * Return		: 	None
 * 
 * Description	: 	Put the module into TX mode (Standby II state)
 * 
 */

void
NRF24L01_EnableTxMode()
{
	unsigned char ucCurrentVal = NRF24L01_GetStatus();

	// PS: Power up the device
	NRF24L01_PowerUp();

	// PS: Clear TX_DS and MAX_RT interrupts
	ucCurrentVal |= (RF24_MAX_RT | RF24_TX_DS);
	NRF24L01_RegisterWrite_8(RF24_STATUS, ucCurrentVal);

